<a href="https://colab.research.google.com/github/Nelson-Muteti/WEEK-3-IP/blob/main/Nelson_Muteti_IP_Week_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#first import pandas library
import pandas as pd
# as well as the Numpy library
import numpy as np

In [ ]:
# Loading first Telcom dataset from csv file
data = "/content/Telcom_dataset.csv"
df1 = pd.read_csv(data)
df1.rename(columns = {"PRODUTC": "PRODUCT", 
                     "DW_A_NUMBER_INT":"DW_A","DW_B_NUMBER_INT":"DW_B"}, 
                                 inplace = True) 

df1.head()

  PRODUCT  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
# Loading second Telcom dataset from csv file
mydata = "/content/Telcom_dataset2.csv"
df2 = pd.read_csv(mydata)
df2.rename(columns = {"DATE_TIME": "DATETIME", 
                     "DW_A_NUMBER":"DW_A","DW_B_NUMBER":"DW_B"}, 
                                 inplace = True) 
df2.head()

  PRODUCT  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [ ]:
# Loading third Telcom dataset from csv file
my_data = "/content/Telcom_dataset3.csv"
df3 = pd.read_csv(my_data)
df3.rename(columns = {"CELLID": "CELL_ID", 
                     "DW_A_NUMBER_INT":"DW_A","DW_B_NUMBER_INT":"DW_B","SIET_ID":"SITE_ID","DATE_TIME":"DATETIME"}, 
                                 inplace = True) 
df3.head()

  PRODUCT  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [ ]:
# Loading 4th dataset from csv file
thatdata = "/content/cells_geo.csv"
df4 = pd.read_csv(thatdata,sep = ";",encoding="utf-8")
df4.rename(columns = {"SITE_CODE":"SITE_ID",}, 
                                 inplace = True) 
df4.head()

   Unnamed: 0   VILLES      STATUS  ... AREA     CELL_ID     SITE_ID
0           0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3           3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f
4           4  ASSINIE  In Service  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 12 columns]

In [ ]:
# Loading 5th dataset from an xslx file
new_data = "/content/cells_geo_description.xlsx"
df5 = pd.read_excel(new_data)
df5.head

<bound method NDFrame.head of      Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String>

In [ ]:
#Loading 6th dataset from an xslx file
somedata = "/content/CDR_description.xlsx"
df6 = pd.read_excel(somedata)
df6

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

In [ ]:
#get the columns in dataset 1
df1.columns

Index(['PRODUCT', 'VALUE', 'DATETIME', 'CELL_ON_SITE', 'DW_A', 'DW_B',
       'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [ ]:
#get the columns in dataset 2
df2.columns

Index(['PRODUCT', 'VALUE', 'DATETIME', 'CELL_ON_SITE', 'DW_A', 'DW_B',
       'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [ ]:
#get the columns in dataset 3
df3.columns

Index(['PRODUCT', 'VALUE', 'DATETIME', 'CELL_ON_SITE', 'DW_A', 'DW_B',
       'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [ ]:
#check numerical makeup of data

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PRODUCT       5001 non-null   object
 1   VALUE         5001 non-null   int64
 2   DATETIME      5001 non-null   object
 3   CELL_ON_SITE  5001 non-null   object
 4   DW_A          5001 non-null   object
 5   DW_B          5001 non-null   object
 6   COUNTRY_A     5001 non-null   object
 7   COUNTRY_B     5001 non-null   object
 8   CELL_ID       5001 non-null   object
 9   SITE_ID       4285 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [ ]:
#check numerical makeup of data
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PRODUCT       5001 non-null   object
 1   VALUE         5001 non-null   int64
 2   DATETIME      5001 non-null   object
 3   CELL_ON_SITE  5001 non-null   object
 4   DW_A          5001 non-null   object
 5   DW_B          5001 non-null   object
 6   COUNTRY_A     5001 non-null   object
 7   COUNTRY_B     5001 non-null   object
 8   CELL_ID       5001 non-null   object
 9   SITE_ID       4325 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [ ]:
#check numerical makeup of data
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PRODUCT       5001 non-null   object
 1   VALUE         5001 non-null   int64
 2   DATETIME      5001 non-null   object
 3   CELL_ON_SITE  5001 non-null   object
 4   DW_A          5001 non-null   object
 5   DW_B          5001 non-null   object
 6   COUNTRY_A     5001 non-null   object
 7   COUNTRY_B     5001 non-null   object
 8   CELL_ID       5001 non-null   object
 9   SITE_ID       4396 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [ ]:
#After confirming the column names merge the dataframes

df = pd.concat([df1, df2,df3],axis=0,ignore_index=True)
df.head()

  PRODUCT  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
#glimpse at new merged dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15003 entries, 0 to 15002
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PRODUCT       15003 non-null  object
 1   VALUE         15003 non-null  int64
 2   DATETIME      15003 non-null  object
 3   CELL_ON_SITE  15003 non-null  object
 4   DW_A          15003 non-null  object
 5   DW_B          15003 non-null  object
 6   COUNTRY_A     15003 non-null  object
 7   COUNTRY_B     15003 non-null  object
 8   CELL_ID       15003 non-null  object
 9   SITE_ID       13006 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.1+ MB

In [ ]:
#get a glimpse of the dataset
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3974 entries, 0 to 3973
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    3974 non-null   int64
 1   VILLES        3974 non-null   object
 2   STATUS        3907 non-null   object
 3   LOCALISATION  3974 non-null   object
 4   DECOUPZONE    3974 non-null   object
 5   ZONENAME      3968 non-null   object
 6   LONGITUDE     3974 non-null   float64
 7   LATITUDE      3974 non-null   float64
 8   REGION        3974 non-null   object
 9   AREA          3951 non-null   object
 10  CELL_ID       3974 non-null   object
 11  SITE_ID       3974 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 372.7+ KB

In [ ]:
df4.columns

Index(['Unnamed: 0', 'VILLES', 'STATUS', 'LOCALISATION', 'DECOUPZONE',
       'ZONENAME', 'LONGITUDE', 'LATITUDE', 'REGION', 'AREA', 'CELL_ID',
       'SITE_ID'],
      dtype='object')

In [ ]:
#drop an unnecessary column
df4 = df4.drop('Unnamed: 0', axis=1)
df4.head(2)

   VILLES      STATUS LOCALISATION  ... AREA     CELL_ID     SITE_ID
0  ADJAME  In Service      ABIDJAN  ...  NaN  fbb2e75af3  0bb492ef17
1  ADJAME  In Service      ABIDJAN  ...  NaN  1502501d78  0bb492ef17

[2 rows x 11 columns]

In [ ]:
#Merge the two dataframes on site id
merged_df = pd.merge(df,
                 df4[['VILLES', 'STATUS', 'LOCALISATION','DECOUPZONE','ZONENAME','REGION','SITE_ID','LATITUDE','LONGITUDE','AREA']],
                 on='SITE_ID')
merged_df.head()

  PRODUCT  VALUE               DATETIME  ...  LATITUDE LONGITUDE          AREA
0     sms      0  2012-05-07 00:00:00.0  ...  7.718417 -5.027139  CENTRE NORTH
1     sms      0  2012-05-07 00:00:00.0  ...  7.718417 -5.027139  CENTRE NORTH
2     sms      0  2012-05-07 00:00:00.0  ...  7.718417 -5.027139  CENTRE NORTH
3     sms      0  2012-05-07 00:00:00.0  ...  7.718417 -5.027139  CENTRE NORTH
4     sms      0  2012-05-07 00:00:00.0  ...  7.718417 -5.027139  CENTRE NORTH

[5 rows x 19 columns]

In [ ]:
#get general info of the data
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 51361 entries, 0 to 51360
Data columns (total 19 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PRODUCT       51361 non-null  object
 1   VALUE         51361 non-null  int64
 2   DATETIME      51361 non-null  object
 3   CELL_ON_SITE  51361 non-null  object
 4   DW_A          51361 non-null  object
 5   DW_B          51361 non-null  object
 6   COUNTRY_A     51361 non-null  object
 7   COUNTRY_B     51361 non-null  object
 8   CELL_ID       51361 non-null  object
 9   SITE_ID       51361 non-null  object
 10  VILLES        51361 non-null  object
 11  STATUS        50645 non-null  object
 12  LOCALISATION  51361 non-null  object
 13  DECOUPZONE    51361 non-null  object
 14  ZONENAME      51343 non-null  object
 15  REGION        51361 non-null  object
 16  LATITUDE      51361 non-null  float64
 17  LONGITUDE     51361 non-null  float64
 18  AREA          51105 non-null  object
dtypes: float64(2), int64(1), object(16)
memory usage: 7.8+ MB

In [ ]:
#get descriptive values such as mean, standard Deviation and max
#for numerical values
merged_df.describe()

              VALUE      LATITUDE     LONGITUDE
count  51361.000000  51361.000000  51361.000000
mean      28.083371      5.883299     -4.643727
std      112.082966      1.018990      1.059065
min        0.000000      0.000000     -8.408611
25%        0.000000      5.328694     -5.260333
50%        0.000000      5.373222     -4.055778
75%       25.000000      6.128722     -4.002361
max     6750.000000     10.441319     -0.000000

In [ ]:
#Now for some data cleaning on the merged data frames
#finding duplicates in my data is very important. 
merged_df.duplicated()

0        False
1         True
2         True
3         True
4         True
         ...
51356    False
51357     True
51358    False
51359     True
51360     True
Length: 51361, dtype: bool

In [ ]:
#delete the duplicates
merged_df = merged_df.drop_duplicates()
merged_df

      PRODUCT  VALUE               DATETIME  ...  LATITUDE LONGITUDE           AREA
0         sms      0  2012-05-07 00:00:00.0  ...  7.718417 -5.027139   CENTRE NORTH
6       Voice     92  2012-05-07 00:00:06.0  ...  7.718417 -5.027139   CENTRE NORTH
12        sms     25  2012-05-07 00:00:21.0  ...  7.718417 -5.027139   CENTRE NORTH
18      Voice     16  2012-05-07 00:00:21.0  ...  7.718417 -5.027139   CENTRE NORTH
24      Voice     35  2012-05-07 00:00:41.0  ...  7.718417 -5.027139   CENTRE NORTH
...       ...    ...                    ...  ...       ...       ...            ...
51347   Voice      0  2012-05-09 00:01:27.0  ...  7.170250 -5.786194   CENTRE NORTH
51350     sms      0  2012-05-09 00:01:42.0  ...  5.138750 -3.020500  ABIDJAN SOUTH
51353   Voice     47  2012-05-09 00:01:42.0  ...  6.843278 -5.772972   CENTRE NORTH
51356   Voice     17  2012-05-09 00:01:42.0  ...  5.349442 -4.023247  ABIDJAN NORTH
51358     sms      0  2012-05-09 00:01:43.0  ...  7.777056 -5.171778   CENTRE NORTH

[10739 rows x 19 columns]

In [ ]:
#as seen, most of the data points were duplicates.
#the number of rows reduced from 51358 to 10739
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10739 entries, 0 to 51358
Data columns (total 19 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PRODUCT       10739 non-null  object
 1   VALUE         10739 non-null  int64
 2   DATETIME      10739 non-null  object
 3   CELL_ON_SITE  10739 non-null  object
 4   DW_A          10739 non-null  object
 5   DW_B          10739 non-null  object
 6   COUNTRY_A     10739 non-null  object
 7   COUNTRY_B     10739 non-null  object
 8   CELL_ID       10739 non-null  object
 9   SITE_ID       10739 non-null  object
 10  VILLES        10739 non-null  object
 11  STATUS        10342 non-null  object
 12  LOCALISATION  10739 non-null  object
 13  DECOUPZONE    10739 non-null  object
 14  ZONENAME      10733 non-null  object
 15  REGION        10739 non-null  object
 16  LATITUDE      10739 non-null  float64
 17  LONGITUDE     10739 non-null  float64
 18  AREA          10645 non-null  object
dtypes: float64(2), int64(1), object(16)
memory usage: 1.6+ MB

In [ ]:
#more data cleaning
# Missing data in merged  dataset

merged_df.isnull().sum()

PRODUCT           0
VALUE             0
DATETIME          0
CELL_ON_SITE      0
DW_A              0
DW_B              0
COUNTRY_A         0
COUNTRY_B         0
CELL_ID           0
SITE_ID           0
VILLES            0
STATUS          397
LOCALISATION      0
DECOUPZONE        0
ZONENAME          6
REGION            0
LATITUDE          0
LONGITUDE         0
AREA             94
dtype: int64

In [ ]:
#drop Status since it has many null values and may not be an entirely useful column 
merged_df = merged_df.drop('STATUS',axis=1)
merged_df.head(2)

  PRODUCT  VALUE               DATETIME  ...  LATITUDE LONGITUDE          AREA
0     sms      0  2012-05-07 00:00:00.0  ...  7.718417 -5.027139  CENTRE NORTH
6   Voice     92  2012-05-07 00:00:06.0  ...  7.718417 -5.027139  CENTRE NORTH

[2 rows x 18 columns]

In [ ]:
#ascertaining that there is no missing values in the dataset
#drop the area column so as not to skew our data
merged_df = merged_df.drop('AREA',axis=1)
merged_df.head(2)

  PRODUCT  VALUE               DATETIME  ...             REGION  LATITUDE LONGITUDE
0     sms      0  2012-05-07 00:00:00.0  ...  VALLEE DU BANDAMA  7.718417 -5.027139
6   Voice     92  2012-05-07 00:00:06.0  ...  VALLEE DU BANDAMA  7.718417 -5.027139

[2 rows x 17 columns]

In [ ]:
#thats better. The data is now relatively clean.
merged_df.isnull().sum()

PRODUCT         0
VALUE           0
DATETIME        0
CELL_ON_SITE    0
DW_A            0
DW_B            0
COUNTRY_A       0
COUNTRY_B       0
CELL_ID         0
SITE_ID         0
VILLES          0
LOCALISATION    0
DECOUPZONE      0
ZONENAME        6
REGION          0
LATITUDE        0
LONGITUDE       0
dtype: int64

In [ ]:
#next I drop less significant columns from my project
#drop more non-important columns from my dataset
merged_df = merged_df.drop('COUNTRY_A',axis=1)
merged_df = merged_df.drop('COUNTRY_B',axis=1)
merged_df = merged_df.drop('DW_A',axis=1)
merged_df = merged_df.drop('DW_B',axis=1)
merged_df = merged_df.drop('LONGITUDE',axis=1)
merged_df = merged_df.drop('LATITUDE',axis=1)
merged_df = merged_df.drop('SITE_ID',axis =1)
merged_df.head(2)

  PRODUCT  VALUE  ...             ZONENAME             REGION
0     sms      0  ...  ZONE A - Grand-NORD  VALLEE DU BANDAMA
6   Voice     92  ...  ZONE A - Grand-NORD  VALLEE DU BANDAMA

[2 rows x 10 columns]

In [ ]:
#now i have 10 columns with 10739 rows that can help in my insights
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10739 entries, 0 to 51358
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PRODUCT       10739 non-null  object
 1   VALUE         10739 non-null  int64
 2   DATETIME      10739 non-null  object
 3   CELL_ON_SITE  10739 non-null  object
 4   CELL_ID       10739 non-null  object
 5   VILLES        10739 non-null  object
 6   LOCALISATION  10739 non-null  object
 7   DECOUPZONE    10739 non-null  object
 8   ZONENAME      10733 non-null  object
 9   REGION        10739 non-null  object
dtypes: int64(1), object(9)
memory usage: 922.9+ KB

In [ ]:
#Get the most used cities
#From the code below,YOPOUGON was the most used city, having being used 1765 times for the duration - A very useful insight
n = 20
merged_df['VILLES'].value_counts()[:n]

YOPOUGON        1765
ABOBO           1202
COCODY           744
ADJAME           564
KOUMASSI         441
MARCORY          430
TREICHVILLE      398
YAMOUSSOUKRO     362
PORT-BOUET       313
ATTECOUBE        307
DALOA            306
BOUAKE           263
SAN-PEDRO        223
DIVO             207
KORHOGO          148
GAGNOA           142
MAN              132
SOUBRE            99
DABOU             88
DUEKOUE           76
Name: VILLES, dtype: int64

In [ ]:
#Which MTN product was the most used between sms and voice and data.
#From below, sms was the most used service product - A very useful insight
n = 4
merged_df['PRODUCT'].value_counts()[:n]

sms      6010
Voice    4729
Name: PRODUCT, dtype: int64

In [ ]:
#JUst checking the region in Cote D'Ivoire with most MTN use.
#Lagune region was by far the top region where MTN services were in more use - A very useful insight
n = 20
merged_df['REGION'].value_counts()[:n]

LAGUNE               6715
BAS SASSANDRA         473
LACS                  459
HAUT SASSANDRA        431
VALLEE DU BANDAMA     366
SUD BANDAMA           341
SAVANE                333
FROMAGER              220
WORODOUGOU            207
18 MONTAGNES          193
MARAHOUE              181
NZI COMOE             154
AGNEBY                150
MOYEN CAVALLY         132
DENGUELE              132
ZANZAN                100
MOYEN COMOE            65
SUD COMOE              54
BAFING                 33
Name: REGION, dtype: int64

In [ ]:
#Checking what products were more valuable
#apparently, voice products were more valuable than 
#all other products combined - A very useful insight for my recommendations
merged_df.groupby(['PRODUCT']).sum()

          VALUE
PRODUCT
Voice    260011
sms       49400

In [ ]:
#in which villes (cities) were the individual products popular
#this helps prioritise specific mTN products for specific cities according to demand.
merged_df.groupby(['PRODUCT', 'VILLES']).size()

PRODUCT  VILLES
Voice    ABENGOUROU        18
         ABOBO            376
         ABOISSO            7
         ABOISSO COMOE      4
         ABONGOUA           1
                         ...
sms      ZAIBO              5
         ZAROKO             1
         ZIKISSO            6
         ZOUKOUGBEU         2
         ZUENOULA          18
Length: 601, dtype: int64

In [ ]:
#get the cities which had the highest billing value by mean
grouped = merged_df.groupby('VILLES').agg({'VALUE': ['mean', 'min', 'max']})
grouped

                   VALUE
                    mean min   max
VILLES
ABENGOUROU     55.000000   0   480
ABOBO          20.436772   0  3380
ABOISSO        18.333333   0   180
ABOISSO COMOE  44.166667   0   150
ABONGOUA        1.000000   1     1
...                  ...  ..   ...
ZATTA           1.000000   1     1
ZIKISSO        26.888889   0   110
ZON-HOUNIEN    40.333333   0   100
ZOUKOUGBEU     59.500000  25   136
ZUENOULA       30.523810   0   476

[400 rows x 3 columns]

In [ ]:
#this give the total billing value for MTN products for the three days
merged_df['VALUE'].sum()

309411

In [ ]:
#try to understand what cities in the regions had highest value to the company revenue
f = merged_df['VALUE'].groupby([merged_df['REGION'], merged_df['VILLES']]).mean()
print(f)

REGION        VILLES
18 MONTAGNES  BANGOLO        17.166667
              BIANKOUMA      10.500000
              BIN HOUNIEN    60.000000
              DANANE         68.200000
              DIEOUZON        0.000000
                               ...
ZANZAN        TABAGNE        52.000000
              TANDA          59.666667
              TANDI          18.000000
              TAOUDI          0.000000
              TRANSUA        51.000000
Name: VALUE, Length: 404, dtype: float64

In [ ]:
#the highest billed MTN customer was from Cocody in Lagune
merged_df.sort_values(by='VALUE', ascending=False).head()

      PRODUCT  VALUE  ...                 ZONENAME        REGION
45591   Voice   6750  ...     ZONE B - Abidjan_EST        LAGUNE
19977   Voice   3380  ...    ZONE E - Abidjan_NORD        LAGUNE
48410   Voice   2330  ...     ZONE D - Grand-OUEST  18 MONTAGNES
3099    Voice   2212  ...       ZONE C - Grand-EST     NZI COMOE
43735   Voice   2120  ...  ZONE A - Abidjan_CENTRE        LAGUNE

[5 rows x 10 columns]

In [ ]:
#just get the number of unique cell id (unique customers who transacted over the course of the 3 days)
merged_df['CELL_ID'].count()

10739